In [96]:
# Chapter 1
import pandas as pd
import numpy as np

In [97]:
# Table 생성
obj = pd.Series([4, 7, -5, 3])
# data = {'A' : 1, 'B' : 2}
# obj = pd.Series(data)

# state = ['California', 'Ohio', 'Oregon', 'Texas']
# obj = pd.Series(data, index = state)

obj
# 앞에줄은 index, 뒤에는 values이다

0    4
1    7
2   -5
3    3
dtype: int64

In [98]:
# value, index 출력하기
obj.values
obj.index

RangeIndex(start=0, stop=4, step=1)

In [99]:
# index 설정하기
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [100]:
# index를 지정하여 생성
obj2 = pd.Series([4, 7, -5, 3], index = ['a', 'b', 'c', 'd'])
# index 를 이용해서 value도 호출및 수정이 가능
obj2['d']

3

In [101]:
# Series는 Boolean, Scala 연산을 할 수 있다
# obj2[obj2>0] -> True 일 때 Line이 출력 
# obj2 * 2 -> 각 line의 value에 Scala 연산 처리

# obj + obj2 같은 연산 처리도 index가 같은 것끼리 연산이 된다
# 만일 양쪽에 서로 등장하지 않는 index라면 NaN 값을 반환한다

In [102]:
# Series에 제목을 붙일 수 도 있다
# obj4.name = 'Population'
# obj4.index.name = 'State' -> index에도 naming 을 할 수 있다

In [103]:
# data 생성은 Series의 data 생성과 동일하다
# frame = pd.DataFrame(data) -> 이런 식으로 DF를 정의할 수 있다

# frame.head()를 통해 상위 5개의 DF를 불러올 수 있다.
data = {'State':['Korea', 'USA', 'Italia'],
       'Quantity':[500, 3000, 1300],
       'GDP':[4.5, 4.8, 4.1]}
frame = pd.DataFrame(data, index=['One', 'Two', 'Three'])
frame.head()

        State  Quantity  GDP
One     Korea       500  4.5
Two       USA      3000  4.8
Three  Italia      1300  4.1

In [104]:
# frame.columns 를 통해 가로줄의 name들을 뽑아낼 수 있다
frame.columns

Index(['State', 'Quantity', 'GDP'], dtype='object')

In [105]:
# frame['State'] -> 해당 name의 세로줄을 출력
# frame.loc['Three'] -> 해당 Index의 가로줄 출력

# frame.columns -> 가로
# frame.index -> 세로

In [106]:
# del 명령어를 통해 칼럼을 지울 수도 있다
del frame['GDP']
frame

        State  Quantity
One     Korea       500
Two       USA      3000
Three  Italia      1300

In [107]:
# T Method를 이용하여 테이브을 변환시킬 수 있다
frame.T

            One   Two   Three
State     Korea   USA  Italia
Quantity    500  3000    1300

In [108]:
frame

        State  Quantity
One     Korea       500
Two       USA      3000
Three  Italia      1300

In [109]:
# Chapter 2

In [110]:
obj = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2 # reindex 의 순서에 맞게 value들을 정리, 없던 index는 NaN으로 초기화

a   -5.0
b    7.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [111]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill') # ffill: front fill, 앞에 인자로 빈 인자를 채워줌

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [112]:
obj3.drop(0, axis=0) # 해당 method를 통해 특정 행 or 열을 지울 수 있다
# axis를 1로 수정하면 행을 지울 수 있다
# axis를 columns으로 설정해도 동일하다
# drop Method는 삭제됐을때 예시를 출력, 실제로는 반영되진 않는다
# obj3.drop(0, axis=0, inplace=True) 처럼 inplace Method를 True로 설정해주면 반영된다

2    purple
4    yellow
dtype: object

In [113]:
# 다양한 표현으로 인자를 추출해보자
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [114]:
# obj['b'] -> 1.0
display(obj[2:4])
display(obj[['b', 'a', 'd']])
display(obj[obj<2])
display(obj['b':'c'])

# 호출 및 산술연산도 당연히 가능
# obj['b':'d'] = 5.0 -> b ~ d까지 5.0이 대입됨

c    2.0
d    3.0
dtype: float64

b    1.0
a    0.0
d    3.0
dtype: float64

a    0.0
b    1.0
dtype: float64

b    1.0
c    2.0
dtype: float64

In [116]:
# 여러가지 columns와 row가 있을 때 예시
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utha', 'New York'],
                   columns=['One', 'Two', 'Three', 'Four'])
data

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utha        8    9     10    11
New York   12   13     14    15

In [120]:
display(data[:2]) # Slicing을 이해하자
display(data[data['Three'] > 5]) # index == 'Three'가 5보다 큰 Line을 출력
display(data < 5)
# data[data < 5] = 5 -> 인자에 접근하여 수정이 가능하다

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7

          One  Two  Three  Four
Colorado    4    5      6     7
Utha        8    9     10    11
New York   12   13     14    15

In [124]:
# loc, iloc 함수로 찾을 수 있다
display(data.loc['Ohio',['Two', 'Three']]) # 앞은 row, 뒤는 Columns
display(data.iloc[2,[3, 0, 1]])

Two      1
Three    2
Name: Ohio, dtype: int64

Four    11
One      8
Two      9
Name: Utha, dtype: int64

In [127]:
# data간에 Scala 연산을 할 때 NaN이 되는 Case들이 있다
# 이러한 경우를 위해 초기화 하는 Method가 있다
df1 = pd.DataFrame(np.arange(12.).reshape(3, 4),
                 columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape(4, 5),
                  columns=list('abcde'))
display(df1.add(df2))
display(df1.add(df2, fill_value=0))

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [133]:
# index가 정렬되어 있지 않다면 정렬해줄 수 있다
obj = pd.Series(range(4), index=['b','d','a','c'])
display(obj.sort_index(axis=0, ascending=False))
# axis=1 은 Columns를 정렬, accending=False는 내림차순이다

display(obj.sort_values())
# sort_values를 통해 값을 기준으로 정렬 가능하면 내부 Method도 동일하다(아마?)
# NaN은 맨 뒤로 간다
# 내부 Method에 by='b' 같이 index를 지정해서 특정 Index만을 기점으로 정렬이 가능하다

d    1
c    3
b    0
a    2
dtype: int64

b    0
d    1
a    2
c    3
dtype: int64

In [134]:
# rank 함수를 통해 순위도 출력 가능
# obj.rand() -> 공동 N등 : N+(N+1)/2
# obj.rank(method='first') -> 먼저 출현할 수록 N에 가까운 수를 받음
# obj.rand(method='max') -> 동률일 경우 높은 수에 동률들을 맞춤

In [135]:
# is_unique Method를 통해 중복 인덱스를 확인할 수 있다
obj.index.is_unique
# True : 중복되는 Index가 존재하지 않는다는 의미

True

In [137]:
# Chapter 3
# 계산과 관련된 Method가 소개된다
df = pd.DataFrame([[1, np.nan],[7, -4], [np.nan, np.nan], [0, -1]],
                 index=list('abcd'), columns=['One', 'Two'])
df

   One  Two
a  1.0  NaN
b  7.0 -4.0
c  NaN  NaN
d  0.0 -1.0

In [140]:
display(df.sum()) # 각 columns의 총 합을 표시한다
display(df.sum(axis=1)) # row도 가능하다

One    8.0
Two   -5.0
dtype: float64

a    1.0
b    3.0
c    0.0
d   -1.0
dtype: float64

In [141]:
df.idxmax()

One    b
Two    d
dtype: object